inventory_service_perf/wrk_report/inventory_python311_mix_1000.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 4.702ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.68ms    2.99ms 237.95ms   80.50%
    Req/Sec     1.03k   133.23     1.94k    70.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.95ms
 75.000%    6.60ms
 90.000%    7.97ms
 99.000%   10.78ms
 99.900%   28.11ms
 99.990%   45.73ms
 99.999%  235.52ms
100.000%  238.08ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.662     0.000000            1         1.00
       2.095     0.100000        10959         1.11
       2.539     0.200000        21940         1.25
       2.845     0.300000        32867         1.43
       3.199     0.400000        43811         1.67
       3.951     0.500000        54765         2.00
       4.575     0.550000        60229         2.22
       5.047     0.600000        65738         2.50
       5.499     0.650000        71186         2.86
       5.999     0.700000        76682         3.33
       6.599     0.750000        82129         4.00
       6.903     0.775000        84887         4.44
       7.159     0.800000        87640         5.00
       7.379     0.825000        90385         5.71
       7.575     0.850000        93078         6.67
       7.763     0.875000        95816         8.00
       7.867     0.887500        97191         8.89
       7.975     0.900000        98580        10.00
       8.099     0.912500        99960        11.43
       8.223     0.925000       101312        13.33
       8.375     0.937500       102713        16.00
       8.455     0.943750       103348        17.78
       8.559     0.950000       104054        20.00
       8.671     0.956250       104716        22.86
       8.823     0.962500       105422        26.67
       9.015     0.968750       106081        32.00
       9.143     0.971875       106435        35.56
       9.287     0.975000       106765        40.00
       9.463     0.978125       107110        45.71
       9.687     0.981250       107455        53.33
       9.951     0.984375       107792        64.00
      10.103     0.985938       107965        71.11
      10.335     0.987500       108136        80.00
      10.623     0.989062       108305        91.43
      10.887     0.990625       108476       106.67
      11.295     0.992188       108652       128.00
      11.511     0.992969       108738       142.22
      11.807     0.993750       108818       160.00
      12.223     0.994531       108906       182.86
      12.799     0.995313       108990       213.33
      13.567     0.996094       109075       256.00
      13.983     0.996484       109118       284.44
      14.535     0.996875       109161       320.00
      15.375     0.997266       109203       365.71
      17.455     0.997656       109246       426.67
      19.775     0.998047       109289       512.00
      21.071     0.998242       109310       568.89
      22.527     0.998437       109331       640.00
      24.031     0.998633       109353       731.43
      25.391     0.998828       109374       853.33
      28.479     0.999023       109396      1024.00
      28.815     0.999121       109406      1137.78
      29.583     0.999219       109417      1280.00
      30.495     0.999316       109428      1462.86
      31.055     0.999414       109438      1706.67
      31.631     0.999512       109450      2048.00
      32.335     0.999561       109454      2275.56
      33.471     0.999609       109460      2560.00
      34.367     0.999658       109465      2925.71
      34.943     0.999707       109470      3413.33
      35.583     0.999756       109476      4096.00
      35.743     0.999780       109478      4551.11
      36.319     0.999805       109481      5120.00
      36.703     0.999829       109484      5851.43
      37.375     0.999854       109486      6826.67
      40.383     0.999878       109489      8192.00
      40.895     0.999890       109490      9102.22
      45.919     0.999902       109492     10240.00
      49.023     0.999915       109493     11702.86
      49.471     0.999927       109494     13653.33
     134.399     0.999939       109496     16384.00
     134.399     0.999945       109496     18204.44
     139.519     0.999951       109497     20480.00
     143.743     0.999957       109498     23405.71
     143.743     0.999963       109498     27306.67
     144.767     0.999969       109499     32768.00
     144.767     0.999973       109499     36408.89
     231.423     0.999976       109500     40960.00
     231.423     0.999979       109500     46811.43
     231.423     0.999982       109500     54613.33
     235.519     0.999985       109501     65536.00
     235.519     0.999986       109501     72817.78
     235.519     0.999988       109501     81920.00
     235.519     0.999989       109501     93622.86
     235.519     0.999991       109501    109226.67
     238.079     0.999992       109502    131072.00
     238.079     1.000000       109502          inf
#[Mean    =        4.679, StdDeviation   =        2.993]
#[Max     =      237.952, Total count    =       109502]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119800 requests in 2.00m, 36.64MB read
Requests/sec:    998.32
Transfer/sec:    312.64KB