inventory_service_perf/wrk_report/inventory_python311_mix_1100.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 43.247ms, rate sampling interval: 124ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.11ms   31.84ms 786.43ms   95.85%
    Req/Sec     1.10k   211.00     1.67k    61.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   44.42ms
 75.000%   56.13ms
 90.000%   65.60ms
 99.000%  136.83ms
 99.900%  489.21ms
 99.990%  671.74ms
 99.999%  756.22ms
100.000%  786.94ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.085     0.000000            1         1.00
      24.095     0.100000        12074         1.11
      29.871     0.200000        24111         1.25
      34.975     0.300000        36170         1.43
      39.711     0.400000        48241         1.67
      44.415     0.500000        60263         2.00
      46.719     0.550000        66300         2.22
      48.959     0.600000        72303         2.50
      51.327     0.650000        78320         2.86
      53.727     0.700000        84346         3.33
      56.127     0.750000        90377         4.00
      57.375     0.775000        93444         4.44
      58.591     0.800000        96374         5.00
      59.967     0.825000        99402         5.71
      61.535     0.850000       102433         6.67
      63.327     0.875000       105418         8.00
      64.383     0.887500       106917         8.89
      65.599     0.900000       108416        10.00
      67.007     0.912500       109964        11.43
      68.607     0.925000       111428        13.33
      70.591     0.937500       112942        16.00
      71.743     0.943750       113695        17.78
      73.087     0.950000       114451        20.00
      74.687     0.956250       115218        22.86
      76.479     0.962500       115964        26.67
      78.847     0.968750       116720        32.00
      80.127     0.971875       117075        35.56
      81.983     0.975000       117462        40.00
      84.031     0.978125       117828        45.71
      87.167     0.981250       118205        53.33
     101.311     0.984375       118584        64.00
     104.959     0.985938       118768        71.11
     111.679     0.987500       118957        80.00
     125.887     0.989062       119144        91.43
     145.407     0.990625       119332       106.67
     169.087     0.992188       119520       128.00
     192.895     0.992969       119615       142.22
     217.087     0.993750       119711       160.00
     237.311     0.994531       119803       182.86
     259.839     0.995313       119897       213.33
     286.975     0.996094       119992       256.00
     297.471     0.996484       120039       284.44
     315.903     0.996875       120086       320.00
     341.503     0.997266       120132       365.71
     362.751     0.997656       120179       426.67
     386.047     0.998047       120226       512.00
     401.919     0.998242       120250       568.89
     423.679     0.998437       120273       640.00
     444.671     0.998633       120297       731.43
     468.223     0.998828       120320       853.33
     491.775     0.999023       120345      1024.00
     505.343     0.999121       120356      1137.78
     521.215     0.999219       120367      1280.00
     537.087     0.999316       120379      1462.86
     550.911     0.999414       120391      1706.67
     575.487     0.999512       120403      2048.00
     580.095     0.999561       120409      2275.56
     586.239     0.999609       120414      2560.00
     599.551     0.999658       120421      2925.71
     607.743     0.999707       120426      3413.33
     623.615     0.999756       120432      4096.00
     625.663     0.999780       120435      4551.11
     629.759     0.999805       120438      5120.00
     634.367     0.999829       120441      5851.43
     646.655     0.999854       120445      6826.67
     654.335     0.999878       120447      8192.00
     664.063     0.999890       120448      9102.22
     673.279     0.999902       120450     10240.00
     677.887     0.999915       120451     11702.86
     692.223     0.999927       120453     13653.33
     703.999     0.999939       120454     16384.00
     714.239     0.999945       120455     18204.44
     724.479     0.999951       120456     20480.00
     724.479     0.999957       120456     23405.71
     724.991     0.999963       120457     27306.67
     740.351     0.999969       120458     32768.00
     740.351     0.999973       120458     36408.89
     755.199     0.999976       120459     40960.00
     755.199     0.999979       120459     46811.43
     755.199     0.999982       120459     54613.33
     756.223     0.999985       120460     65536.00
     756.223     0.999986       120460     72817.78
     756.223     0.999988       120460     81920.00
     756.223     0.999989       120460     93622.86
     756.223     0.999991       120460    109226.67
     786.943     0.999992       120461    131072.00
     786.943     1.000000       120461          inf
#[Mean    =       47.112, StdDeviation   =       31.844]
#[Max     =      786.432, Total count    =       120461]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  130901 requests in 2.00m, 39.98MB read
Requests/sec:   1090.70
Transfer/sec:    341.11KB